{
  "posts": [
    {
      "id": "0",
      "title": "I would continue doing this for the rest of my life.",
      "body": "I have been lying to my wife almost everyday for the last fifteen years. Those expecting an extra-marital affair or soft porn are advised to skip the rest as you will be utterly discouraged in the following lines.",
      "like": "1"
    },
    {
      "id": "1",
      "title": "I am marrying a rape survivor.",
      "body": "She is my school friend (let her be X). She was popular back then, really beautiful. We were not great friends back then but yeah, I had a crush on her for a year (reason I fucked up my competitive exams) though she had boyfriend in school.

      Then after boards our ways parted and I forgot about her. I was doing well, met a girl in college and fell for her.
      
      And in third year she got pregnant and I felt the terror inside me (though it was initial days of pregnancy), with some doctor I knew we aborted the beautiful child.
      
      Things came back to normal but I realized what could have been the consequences of fun from the girl's point of view.
      
      In our final year we broke up.",
      "like": "1"
    },
    {
      "id": "2",
      "title": "When I was 16 I got pregnant by my boyfriend.",
      "body": "When I was 16 I got pregnant by my "boyfriend".
      He was the second person I ever had sex with though I didn't want to have sex. I wasn't raped, really. I have Aspergers and I felt very pressured by my so-called friends to have sex in order to be normal. Which is bizarre because I had no concern for normality or fitting in at all, and in fact stood out vastly. Yet I did this, and looking back I think it was because I just didn't understand sex.
      He was several years older than me, the best friend of my best friends crush. Once I was alone with him I didn't know I could say no. I didn't know it was an option. Adults never talked to me about sex (let alone many other things) so I was under the impression it was something females had to do to please their boyfriends, even if they didn't want to or if it was painful. I was horribly naive.",
      "like": "1"
    }, 
    {
      "id": "3",
      "title": "Read this if you have enough courage.",
      "body": "A really good and expensive hotel buys oil for cooking. They use it a few times, and then sell it to another, cheaper, hotel. That hotel uses this second-hand oil almost for one day. (After frying a batch of items, new oil is added to the pan without discarding the left-over old one.) Once done, they sell this oil to an even cheaper eatery. This eatery again uses it for a day or two and sells it to road-side vendors. These vendors use it for another day and by this time, this oil is totally spoilt. Once they are done with it, they now sell this oil (which is now fifth-hand) to those homemade-tiffin-entrepreneurs. They then use it for the supposedly home-made food you get in those packed tiffins at a fraction of the cost you’d pay in a decent hotel.",
      "like": "1"
    }, 
    {
      "id": "4",
      "title": "My brother molested me, constantly for 3 years.",
      "body": "Let's zoom in at the present scenario first. I'm 22 now and I have an elder brother who is 25. Like most sisters, I love him to the core. We laugh, we cry, argue, care...I simply cannot live without him. He is my happy place. My advisor. Friend. Teacher. My alter ego.
      But now, let us rewind a little. When I was maybe 14-15 years old, I started having weird dreams. Nightmares, to be precise. I would dream of my brother touching me inappropriately. His hands over and inside me. Making me touch him. He used to explore my body and taste every part of it. I used to remember in the morning and cry my heart out. Could not even look him in the eye for thinking about him like that.
      But then, as I grew order..I started to remember..remember that those dreams weren't just that but more. Those were my memories somehow getting triggered. Memories when I was maybe 10 or 11 years old. Memories of my own brother harassing me. I didn't remember anything. Nothing at all.
      I didn't know how to even deal with the thought of it. My own brother, the person I admire, doing such things to me. 'His little princess' he called me.
      Somewhere in my mind, I have forced myself to believe that those were just dreams. It's easier for me to live that way. But I still get those nightmares. He has scarred me for life.
      ",
      "like": "1"
    }, 
    {
      "id": "5",
      "title": "I was physically abused by policemen. Men holding higher authority of society than I do.
      ",
      "body": "I had just turned 16. I was going home from music lessons when two guys showed me their ID cards and demanded I go with them into their car. I think it was a federal vehicle.

      They asked me my chest size, how advanced I was in sexual matters, why I was out at this hour. “You welcomed trouble,” they joked. I was at a loss of words. Forceful grabs and commands followed. I eventually started crying. I don’t know why but one of the men surprisingly showed sympathy. He told the other man to let me go and make sure I come back the next day, to their office this time, after gaining emotional stablility. They took my number. Couldn’t cheat there, they made sure their test call made my phone ring. Once out of the car, I ran like anything.",
      "like": "1"
    }, 
    {
      "id": "6",
      "title": "So my ugly story goes like this.",
      "body": "Was born in a middle class family. Life wa great until 2or 3rd grade. Constantly faced harassment after that from different men who visited our home. Was raped daily by a uncle for 4+ years , with whom we had to stay for few years. The worst thing which can happen to girl is getting touched when she doesn't want. The pain I went through is something which I can never forget and the core reason of my nightmares. The only thing I ever pray is that , any girl shouldn't ever go through such a phase. Cause once it's done you hate yourself.When his son came up, he too had his share of fun and put me into more trauma. To keep me shut i ws taken to amusement parks and given all sort of luxury a child dreams of.

      My parents, I was ignored by them as I have younger siblings and they were too busy taking care of them. I literally got into depression from a young age and till now go through it and also hurt myself. After we moved out from that place, I ws molested by my cousins, and so called relatives too. Not that I dint raise my voice, jus that no one heard it.
      
      My mother knwng that I ws raped, blamed me instead that II attract men on purpose , and that hurted me to the core and put me into more depression.
      
      My trust in humaity broke when I realised that my dad lusts on me. And I was shattered the day he too raped me. Despite me yelling, and syn him to stop , he jus went on squeezing my not soo fully grown booobs and kissing me all over and what not. It hurts.. It hurts to the core when your superman turns out to be something worse than a demon. It hurts when u can't brag about your hero with others. And it fucking kills when you see other girls of your age having great dads. And yes he did that several times .
      
      To add to this, I was denied of my education. But because of my good academic marks I had freeship and managed to complete my 12th. Now I want to study further and get out of this hell. But my parents refuse to fund my education. Tried getting part time jobs but that isn't enough to even get my uniform. Currently em lost and seeking new ways to earn and support my education and take up something. Life had taught me so many lessons, but I wish It could teach me how to get make my life better. I can see no rays of hopes. I hope I figure out something and become a free bird for once and all.
      
      ",
      "like": "1"
    }, 
    {
      "id": "7",
      "title": "I am scared.",
      "body": "I was reading this question and avoiding to answer it for a long time , but I think i should answer it now, so that I feel I have at least said it somewhere.

      The secret is that for a long time I am scared of life, I am in constant thoughts of ending my life as I am finding it difficult to cope up with the daily stress.
      
      I was not like this few years back, it all started in 2013 when my father`s business went down and he was diagnosed with diabetes and various infections, My father has always been the ideal father, hardworking, fighting the life and working ways to make our life easy, I have two brothers , and I was always the brightest in studies and eldest, so naturally my family expects a lot from me, I learn things quickly, you give me a book I will tell you the gist of the book in few hours, I like to read, and I can work hard, I have worked hard, but I procrastinate a lot, I always d+eam of having the best job, the best family and best of everything, and It was all good till 2013.
      
      I passed out of college with an engineer tag and a job in the largest IT firm in India. Money was always a factor in the family , I wanted to go for coaching after 12 for JEE but since my father had limited income and two other children to feed and educate , I sought admission in a private college , did good in college , earned a honors degree and a Job.",
      "like": "1"
    }, 
    {
      "id": "8",
      "title": "I've fallen for my best friend's girlfriend.",
      "body": "I've studied with this guy right from nursery school to graduation. We've always been close. When I visited him a couple of years ago, we three hung out together 24x7. She's warm, loving, fun and affectionate. To her, I'm like an elder brother. She's fond of me. And here I am, I have fallen for her. Don't know how and when, but I have. I feel guilty and embarrassed about it.",
      "like": "1"
    }, 
  ]
}